tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"

# === Fonts ===
cask "font-fira-code-nerd-font"

# === Shell ===
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# === Terminal ===
brew "eza"
brew "git-delta"
brew "fzf"  
brew "fd"
brew "bat"
brew "tlrc"
brew "thefuck"
brew "zoxide"
brew "yazi ffmpeg sevenzip jq poppler ripgrep imagemagick"

# Tools
brew  "imageoptim-cli"
cask "imageoptim"
brew "pandoc"

# === Apps ===
cask "visual-studio-code"
cask "bitwarden"
cask "notion"
cask "slack"

# App Store 
brew "mas"

