brew "mas"

# === Fonts ===
cask "font-fira-code-nerd-font"
cask "font-inter"


# === Terminal ===
brew "eza"
brew "git-delta"
brew "fzf"  
brew "fd"
brew "bat"
brew "tealdeer"
brew "thefuck"
brew "zoxide"
brew "ripgrep"
brew "yazi"
brew "starship"
brew "zellij"
brew "carapace"
brew "yazi"
brew "hyperfine"
brew "bandwhich"
brew "bottom"
brew "onefetch"

# --- Tools ---
brew "git"
brew "grex"
brew "tesseract"
brew  "imageoptim-cli"
cask "imageoptim"
brew "pandoc"
# TODOs:
# Add bws



# === Apps ===
cask "visual-studio-code"
cask "bitwarden"
cask "notion"
cask "slack"
